### 첫번째 실습
- population.csv

In [1]:
import pandas as pd

In [3]:
population = pd.read_csv('data/population.csv', encoding='utf-8')
population

   도시   지역     2020        2015        2010      2005
0  서울  수도권  9668465  10022181.0  10312545.0  10167344
1  부산  경상권  3391946         NaN         NaN   3628293
2  인천  수도권  2942828   2925815.0         NaN   2600495
3  광주  전라권  1450062   1474636.0   1454636.0   1401745
4  대구  경상권  2418436   2466052.0   2431774.0   2456016

In [4]:
population = pd.read_csv('data/population.csv', index_col = "도시" ,encoding='utf-8')
population

     지역     2020        2015        2010      2005
도시
서울  수도권  9668465  10022181.0  10312545.0  10167344
부산  경상권  3391946         NaN         NaN   3628293
인천  수도권  2942828   2925815.0         NaN   2600495
광주  전라권  1450062   1474636.0   1454636.0   1401745
대구  경상권  2418436   2466052.0   2431774.0   2456016

In [5]:
#인덱스명 기준 오름차순으로 보여짐
population.sort_index()

     지역     2020        2015        2010      2005
도시
광주  전라권  1450062   1474636.0   1454636.0   1401745
대구  경상권  2418436   2466052.0   2431774.0   2456016
부산  경상권  3391946         NaN         NaN   3628293
서울  수도권  9668465  10022181.0  10312545.0  10167344
인천  수도권  2942828   2925815.0         NaN   2600495

In [7]:
#열 인덱싱 후 데이터 기준 오름차순으로 보기
population['2010'].sort_values()

도시
광주     1454636.0
대구     2431774.0
서울    10312545.0
부산           NaN
인천           NaN
Name: 2010, dtype: float64

In [8]:
#열 인덱싱 후 데이터 기준 내림차순으로 보기
population['2010'].sort_values(ascending=False)

도시
서울    10312545.0
대구     2431774.0
광주     1454636.0
부산           NaN
인천           NaN
Name: 2010, dtype: float64

In [9]:
#데이터프레임 내 2010년을 기준 오름차순 보여주기
population.sort_values(by='2010')

     지역     2020        2015        2010      2005
도시
광주  전라권  1450062   1474636.0   1454636.0   1401745
대구  경상권  2418436   2466052.0   2431774.0   2456016
서울  수도권  9668465  10022181.0  10312545.0  10167344
부산  경상권  3391946         NaN         NaN   3628293
인천  수도권  2942828   2925815.0         NaN   2600495

In [10]:
#지역을 기준으로 오름차순, 지역이 같을경우 2020년 컬럼 기준 오름차순
population.sort_values(by=["지역","2020"])

     지역     2020        2015        2010      2005
도시
대구  경상권  2418436   2466052.0   2431774.0   2456016
부산  경상권  3391946         NaN         NaN   3628293
인천  수도권  2942828   2925815.0         NaN   2600495
서울  수도권  9668465  10022181.0  10312545.0  10167344
광주  전라권  1450062   1474636.0   1454636.0   1401745

#### count함수
- 각 행, 열별로 데이터의 개수를 세는 함수(NaN제외)

In [13]:
#몇개의 행이있는 지 확인한다(NaN제외)
population.count(axis=0)

지역      5
2020    5
2015    4
2010    3
2005    5
dtype: int64

In [14]:
#몇개의 열이있는 지 확인한다(NaN제외)
population.count(axis=1)

도시
서울    5
부산    3
인천    4
광주    5
대구    5
dtype: int64

In [17]:
#결측치(NaN)를 원하는 데이터로 변경하기
#결측치의 연산은 결측치로 나오기때문!
#fillna 함수 -> 변수명.fillna(value=0) -> fill nan의 약자
population.fillna(value=0, inplace = True)

In [18]:
population

     지역     2020        2015        2010      2005
도시
서울  수도권  9668465  10022181.0  10312545.0  10167344
부산  경상권  3391946         0.0         0.0   3628293
인천  수도권  2942828   2925815.0         0.0   2600495
광주  전라권  1450062   1474636.0   1454636.0   1401745
대구  경상권  2418436   2466052.0   2431774.0   2456016

In [20]:
population.dtypes
population.astype({'2010':'int64'})

     지역     2020        2015      2010      2005
도시
서울  수도권  9668465  10022181.0  10312545  10167344
부산  경상권  3391946         0.0         0   3628293
인천  수도권  2942828   2925815.0         0   2600495
광주  전라권  1450062   1474636.0   1454636   1401745
대구  경상권  2418436   2466052.0   2431774   2456016

### 두번째 실습
- score.csv

In [23]:
import pandas as pd
#score 변수에 score.csv파일 읽어오기,
score = pd.read_csv("data/score.csv",index_col="과목",encoding="euc-kr")
score

     1반  2반  3반  4반
과목
파이썬  45  44  73  39
DB   76  92  45  69
자바   47  92  45  69
크롤링  92  81  85  40
Web  11  79  47  26

In [24]:
#학급별 점수 총합 -> axis = 0 (열 안에서 더해짐)
score.sum()

1반    271
2반    388
3반    295
4반    243
dtype: int64

In [25]:
#과목별 점수 총합 -> axis = 1 (행 안에서 더해짐)
score.sum(axis=1)

과목
파이썬    201
DB     282
자바     253
크롤링    298
Web    163
dtype: int64

In [26]:
#학급별 점수의 합계를 구한 후 내림차순으로 정렬하기
score.sum().sort_values(ascending=False)

2반    388
3반    295
1반    271
4반    243
dtype: int64

#### Q1. 과목별 합계를 구해서 DataFrame에 추가하기!(합계 "Column"추가)

In [ ]:
#1. 과목별 합계구하기 .sum()
#2. 합계 컬럼 추가하기

#### Q2. 과목별 평균을 구해서 "평균" 컬럼 추가 (평균 "Column"추가)

In [ ]:
#1. 합계컬럼 제외하기
#2. 과목별 평균 구하기 .mean()
#3. 평균 컬럼 추가하기